welcome_text = (
    "🎉 <b>Ласкаво просимо до BarBags!</b> 👜\n\n"
    "💼 <b>Що на вас чекає:</b>\n"
    "- Чоловічі сумки для будь-якого випадку. \n"
    "- Стильні аксесуари, які доповнять ваш образ.\n"
    "- Професійна команда, готова допомогти з вибором.\n\n"
    "🌐 <b>Наш сайт:</b> <a href='https://barbags.com.ua/ua'>barbags.com.ua/ua</a>\n"
    "📸 <b>Instagram:</b> <a href='https://www.instagram.com/insite_bags'>@insite_bags</a>\n\n"
    "✨ Зазирніть у <b>каталог</b> і знайдіть щось особливе прямо зараз! Натискайте кнопку нижче ⬇️"
)

about_text = (
    "🏢 <b>BarBags</b> — твій стильний партнер у світі моди та практичності! 👜\n\n"
    "📍 <b>Розташування:</b> Ми працюємо з серця України — з чарівного <u>м. Києва</u>. "
    "Але наші стильні пропозиції доступні у будь-якому куточку країни.\n\n"
    "🌟 <b>Що ми пропонуємо?</b>\n"
    "- Вишукані сумки для будь-якого випадку: від повсякденних до особливих моментів.\n"
    "- Унікальні аксесуари, які завершать твій образ і підкреслять стиль.\n\n"
    "💼 <b>Чому обрати нас?</b>\n"
    "Ми поєднуємо модні тренди, бездоганну якість та доступність, щоб кожен міг відчувати себе впевнено і стильно!\n\n"
    "✨ <b>BarBags — з нами твій стиль завжди на висоті!</b>"
)

contact_info = (
    "📞 <b>Наші контакти:</b>\n\n"
    "- 📲 <b>Телефон:</b> +38 097 461 33 25\n"
    "- 📧 <b>Email:</b> barskyi69@gmail.com\n"
    "- 📸 <b>Instagram:</b> "
    "<a href='https://www.instagram.com/insite_bags?igsh=MW41OG9pbzV0cHFvMw=='>@insite_bags</a>\n\n"
    "🌐 <b>Офіційний сайт:</b> <a href='https://barbags.com.ua/ua'>barbags.com.ua/ua</a>\n\n"
    "💼 Зв’яжіться з нами — ми завжди раді допомогти вам обрати ідеальну сумку чи аксесуар! 😊"
)

faq_texts = {
    "delivery_info": """
<b>📦 ДОСТАВКА</b>

<i>Працюємо з надійними перевізниками:</i>
- 📫 Нова Пошта
- 📬 Укрпошта

<b>⏱ Терміни доставки:</b>
- ✈️ По Україні: 1-2 робочих дні

<b>💳 Вартість:</b>
- 📊 Згідно тарифів перевізника
- 🎁 БЕЗКОШТОВНА доставка від 2000 грн
""",

    "payment_info": """
<b>💰 ОПЛАТА</b>

- 📦 Накладений платіж:
  - Мінімальна передоплата 200 грн.

- 💳 За реквізитами:
  - Миттєве підтвердження.
  - Безпечна оплата.
""",

    "return_info": """
<b>🔄 ПОВЕРНЕННЯ ТА ОБМІН</b>

<i>Прості умови повернення:</i>

- ⏰ 14 днів на повернення
- 🏷 Збережені бірки
- 📦 Оригінальна упаковка
- 🆕 Товар без слідів використання

<b>📝 Як оформити повернення:</b>
1️⃣ Зв'яжіться з нашим менеджером
2️⃣ Відправте товар через 'Нову Пошту'/'Укрпошту'
""",

    "warranty_info": """
<b>🛠️ ГАРАНТІЯ ЯКОСТІ</b>

<i>Ми відповідаємо за якість наших товарів!</i>

<b>⏳ Термін гарантії:</b>
- 📅 3 місяці на весь асортимент

<b>🔍 Гарантія поширюється на:</b>
- ⚡️ Виробничі дефекти
- 🔨 Фурнітуру
- 🧵 Якість швів

<b>📞 Гарантійне обслуговування:</b>
- Зв'яжіться з менеджером
- Опишіть проблему
- Отримайте швидке рішення
"""
}

restricted_words = {"бля", "хуй", "лох"}
